apache/nuttx/arch/arm/src/stm32l0/hardware/stm32l0_rcc.h
/****************************************************************************
 * arch/arm/src/stm32l0/hardware/stm32l0_rcc.h
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

#ifndef __ARCH_ARM_SRC_STM32L0_HARDWARE_STM32L0_RCC_H
#define __ARCH_ARM_SRC_STM32L0_HARDWARE_STM32L0_RCC_H

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

/* Register Offsets *********************************************************/

#define STM32_RCC_CR_OFFSET             0x0000  /* Clock control register */
#define STM32_RCC_ICSCR_OFFSET          0x0004  /* Internal clock sources calibration register */
#define STM32_RCC_CRRCR_OFFSET          0x0008  /* Clock recovery RC register */
#define STM32_RCC_CFGR_OFFSET           0x000C  /* Clock configuration register */
#define STM32_RCC_CIER_OFFSET           0x0010  /* Clock Source Interrupt enable register */
#define STM32_RCC_CIFR_OFFSET           0x0014  /* Clock Source Interrupt Flag register */
#define STM32_RCC_CICR_OFFSET           0x0018  /* Clock Source Interrupt Clear register */
#define STM32_RCC_IOPRSTR_OFFSET        0x001C  /* GPIO reset register */
#define STM32_RCC_AHBRSTR_OFFSET        0x0020  /* AHB peripheral reset register */
#define STM32_RCC_APB2RSTR_OFFSET       0x0024  /* APB2 Peripheral reset register */
#define STM32_RCC_APB1RSTR_OFFSET       0x0028  /* APB1 Peripheral reset register */
#define STM32_RCC_IOPENR_OFFSET         0x002C  /* GPIO clock enable register */
#define STM32_RCC_AHBENR_OFFSET         0x0030  /* AHB Peripheral Clock enable register */
#define STM32_RCC_APB2ENR_OFFSET        0x0034  /* APB2 Peripheral Clock enable register */
#define STM32_RCC_APB1ENR_OFFSET        0x0038  /* APB1 Peripheral Clock enable register */
#define STM32_RCC_IOPSMEN_OFFSET        0x003C  /* GPIO clock enable in Sleep mode register */
#define STM32_RCC_AHBSMENR_OFFSET       0x0040  /* AHB peripheral clock enable in Sleep mode register */
#define STM32_RCC_APB2SMENR_OFFSET      0x0044  /* APB2 peripheral clock enable in Sleep mode register */
#define STM32_RCC_APB1SMENR_OFFSET      0x0048  /* APB1 peripheral clock enable in Sleep mode register */
#define STM32_RCC_CCIPR_OFFSET          0x004C  /* Clock configuration register */
#define STM32_RCC_CSR_OFFSET            0x0050  /* Control/status register */

/* Register Addresses *******************************************************/

#define STM32_RCC_CR                (STM32_RCC_BASE+STM32_RCC_CR_OFFSET)
#define STM32_RCC_ICSCR             (STM32_RCC_BASE+STM32_RCC_ICSCR_OFFSET)
#define STM32_RCC_CRRCR             (STM32_RCC_BASE+STM32_RCC_CRRCR_OFFSET)
#define STM32_RCC_CFGR              (STM32_RCC_BASE+STM32_RCC_CFGR_OFFSET)
#define STM32_RCC_CIER              (STM32_RCC_BASE+STM32_RCC_CIER_OFFSET)
#define STM32_RCC_CIFR              (STM32_RCC_BASE+STM32_RCC_CIFR_OFFSET)
#define STM32_RCC_CICR              (STM32_RCC_BASE+STM32_RCC_CICR_OFFSET)
#define STM32_RCC_IOPRSTR           (STM32_RCC_BASE+STM32_RCC_IOPRSTR_OFFSET)
#define STM32_RCC_AHBRSTR           (STM32_RCC_BASE+STM32_RCC_AHBRSTR_OFFSET)
#define STM32_RCC_APB2RSTR          (STM32_RCC_BASE+STM32_RCC_APB2RSTR_OFFSET)
#define STM32_RCC_APB1RSTR          (STM32_RCC_BASE+STM32_RCC_APB1RSTR_OFFSET)
#define STM32_RCC_IOPENR            (STM32_RCC_BASE+STM32_RCC_IOPENR_OFFSET)
#define STM32_RCC_AHBENR            (STM32_RCC_BASE+STM32_RCC_AHBENR_OFFSET)
#define STM32_RCC_APB2ENR           (STM32_RCC_BASE+STM32_RCC_APB2ENR_OFFSET)
#define STM32_RCC_APB1ENR           (STM32_RCC_BASE+STM32_RCC_APB1ENR_OFFSET)
#define STM32_RCC_IOPSMEN           (STM32_RCC_BASE+STM32_RCC_IOPSMEN_OFFSET)
#define STM32_RCC_AHBSMENR          (STM32_RCC_BASE+STM32_RCC_AHBSMENR_OFFSET)
#define STM32_RCC_APB2SMENR         (STM32_RCC_BASE+STM32_RCC_APB2SMENR_OFFSET)
#define STM32_RCC_APB1SMENR         (STM32_RCC_BASE+STM32_RCC_APB1SMENR_OFFSET)
#define STM32_RCC_CCIPR             (STM32_RCC_BASE+STM32_RCC_CCIPR_OFFSET)
#define STM32_RCC_CSR               (STM32_RCC_BASE+STM32_RCC_CSR_OFFSET)

/* Register Bitfield Definitions ********************************************/

/* Clock control register */

#define RCC_CR_HSION                (1 << 0)  /* Bit 0: Internal high speed clock enable */
#define RCC_CR_HSIKERON             (1 << 1)  /* Bit 1: Internal high speed clock enable for some IP kernels */
#define RCC_CR_HSIRDY               (1 << 2)  /* Bit 2: Internal high speed clock ready flag */
#define RCC_CR_HSIDIV               (1 << 3)  /* Bit 3: Internal high speed clock divider enable */
#define RCC_CR_HSIDIVF              (1 << 4)  /* Bit 4: Internal high speed clock divider flag */
#define RCC_CR_HSIOUTEN             (1 << 5)  /* Bit 5: Internal high speed clock output enable */
                                              /* Bits 6-7: Reserved */
#define RCC_CR_MSION                (1 << 8)  /* Bit 8: MSI clock enable */
#define RCC_CR_MSIRDY               (1 << 9)  /* Bit 9: MSI clock ready flag */
                                              /* Bits 10-15: Reserved */
#define RCC_CR_HSEON                (1 << 16) /* Bit 16: External high speed clock enable */
#define RCC_CR_HSERDY               (1 << 17) /* Bit 17: External high speed clock ready flag */
#define RCC_CR_HSEBYP               (1 << 18) /* Bit 18: External high speed clock bypass */
#define RCC_CR_CSSHSEON             (1 << 19) /* Bit 19: Clock security system on HSE enable */
#define RCC_CR_RTCPRE_SHIFT         (20)      /* Bits 20-21: RTC prescaler */
#define RCC_CR_RTCPRE_MASK          (3 << RCC_CR_RTCPRE_SHIFT)
                                              /* Bits 22-23: Reserved */
#define RCC_CR_PLLON                (1 << 24) /* Bit 24: PLL enable */
#define RCC_CR_PLLRDY               (1 << 25) /* Bit 25: PLL clock ready flag */
                                              /* Bits 26-27: Reserved */

#define RCC_CR_RSTVAL               0x00000b00

