apache/nuttx/arch/arm/src/stm32l0/hardware/stm32l0_rcc.h
#define RCC_CICR_LSIRDYF            (1 << 0)  /* Bit 0: LSI ready interrupt flag */
#define RCC_CICR_LSERDYF            (1 << 1)  /* Bit 1: LSE ready interrupt flag */
#define RCC_CICR_HSIRDYF            (1 << 2)  /* Bit 2: HSI16 ready interrupt flag */
#define RCC_CICR_HSERDYF            (1 << 3)  /* Bit 3: HSE ready interrupt flag */
#define RCC_CICR_PLLRDYF            (1 << 4)  /* Bit 4: PLL ready interrupt flag */
#define RCC_CICR_MSIRDYF            (1 << 5)  /* Bit 5: MSI ready interrupt flag */
#define RCC_CICR_HSI48RDYF          (1 << 6)  /* Bit 6: HSI48 ready interrupt flag */
#define RCC_CICR_CSSLSE             (1 << 7)  /* Bit 7: LSE CSS interrupt flag */

/* GPIO reset register */

#define RCC_IOPRSTR_IOPARST         (1 << 0)  /* Bit 0: IO port A reset */
#define RCC_IOPRSTR_IOPBRST         (1 << 1)  /* Bit 1: IO port B reset */
#define RCC_IOPRSTR_IOPCRST         (1 << 2)  /* Bit 3: IO port C reset */
#define RCC_IOPRSTR_IOPDRST         (1 << 3)  /* Bit 4: IO port D reset */
#define RCC_IOPRSTR_IOPERST         (1 << 4)  /* Bit 4: IO port E reset */
                                              /* Bits 5-6: Reserved */
#define RCC_IOPRSTR_IOPHRST         (1 << 7)  /* Bit 5: IO port H reset */

/* AHB peripheral reset register */

#define RCC_AHBRSTR_DMA1RST         (1 << 0)  /* Bit 0: DMA 1 reset */
                                              /* Bits 1-7: Reserved */
#define RCC_AHBRSTR_MIFRST          (1 << 8)  /* Bit 8: Memory interface reset */
                                              /* Bits 9-11: Reserved */
#define RCC_AHBRSTR_CRCRST          (1 << 12) /* Bit 12: Memory interface reset */
                                              /* Bits 13-15: Reserved */
#define RCC_AHBRSTR_TSCRST          (1 << 16) /* Bit 16: Touch sensing reset */
                                              /* Bits 17-19: Reserved */
#define RCC_AHBRSTR_RNGRST          (1 << 20) /* Bit 20: Random number generator module reset */
                                              /* Bits 21-23: Reserved */
#define RCC_AHBRSTR_AESRST          (1 << 24) /* Bit 24: Crypto module (AES) reset */
                                              /* Bits 25-31: Reserved */

/* APB2 Peripheral reset register */

#define RCC_APB2RSTR_SYSCFGRST      (1 << 0)  /* Bit 0:  System configuration controller reset */
                                              /* Bit 1:  Reserved */
#define RCC_APB2RSTR_TIM21RST       (1 << 2)  /* Bit 2:  TIM21 timer reset */
                                              /* Bits 3-4: Reserved */
#define RCC_APB2RSTR_TIM22RST       (1 << 5)  /* Bit 5:  TIM21 timer reset */
                                              /* Bits 6-8: Reserved */
#define RCC_APB2RSTR_ADC1RST        (1 << 9)  /* Bit 9:  ADC1 interface reset */
                                              /* Bits 10-11: Reserved */
#define RCC_APB2RSTR_SPI1RST        (1 << 12) /* Bit 12: SPI 1 reset */
                                              /* Bit 13: Reserved */
#define RCC_APB2RSTR_USART1RST      (1 << 14) /* Bit 14: USART1 reset */
                                              /* Bits 15-21: Reserved */
#define RCC_APB2RSTR_DBGRST         (1 << 22) /* Bit 22: DBG reset */
                                              /* Bits 23-31: Reserved */

/* APB1 Peripheral reset register */

#define RCC_APB1RSTR_TIM2RST        (1 << 0)  /* Bit 0:  Timer 2 reset */
#define RCC_APB1RSTR_TIM3RST        (1 << 1)  /* Bit 1:  Timer 3 reset */
                                              /* Bits 2-3: Reserved */
#define RCC_APB1RSTR_TIM6RST        (1 << 4)  /* Bit 4:  Timer 6 reset */
#define RCC_APB1RSTR_TIM7RST        (1 << 5)  /* Bit 5:  Timer 7 reset */
                                              /* Bits 6-8: Reserved */
#define RCC_APB1RSTR_LCDRST         (1 << 9)  /* Bit 9:  LCD reset */
                                              /* Bit 10: Reserved */
#define RCC_APB1RSTR_WWDGRST        (1 << 11) /* Bit 11: Window Watchdog reset */
                                              /* Bits 12-13: Reserved */
#define RCC_APB1RSTR_SPI2RST        (1 << 14) /* Bit 14: SPI 2 reset */
                                              /* Bits 15-16: Reserved */
#define RCC_APB1RSTR_USART2RST      (1 << 17) /* Bit 17: USART 2 reset */
#define RCC_APB1RSTR_USART3RST      (1 << 18) /* Bit 18: USART 3 reset */
#define RCC_APB1RSTR_USART4RST      (1 << 19) /* Bit 19: USART 4 reset */
#define RCC_APB1RSTR_USART5RST      (1 << 20) /* Bit 20: USART 5 reset */
#define RCC_APB1RSTR_I2C1RST        (1 << 21) /* Bit 21: I2C 1 reset */
#define RCC_APB1RSTR_I2C2RST        (1 << 22) /* Bit 22: I2C 2 reset */
#define RCC_APB1RSTR_USBRST         (1 << 23) /* Bit 23: USB reset */
                                              /* Bits 24-26: Reserved */
#define RCC_APB1RSTR_CRSRST         (1 << 27) /* Bit 27: Clock recovery system reset */
#define RCC_APB1RSTR_PWRRST         (1 << 28) /* Bit 28: Power interface reset */
#define RCC_APB1RSTR_DAC1RST        (1 << 29) /* Bit 29: DAC 1 interface reset */
#define RCC_APB1RSTR_I2C3RST        (1 << 30) /* Bit 30: I2C3 reset */
#define RCC_APB1RSTR_LPTIM1RST      (1 << 31) /* Bit 31: Low-power timer reset */

/* GPIO clock enable register */

#define RCC_IOPENR_IOPAEN           (1 << 0)  /* Bit 0: IO port A clock enable */
#define RCC_IOPENR_IOPBEN           (1 << 1)  /* Bit 1: IO port B clock enable */
#define RCC_IOPENR_IOPCEN           (1 << 2)  /* Bit 2: IO port C clock enable */
#define RCC_IOPENR_IOPDEN           (1 << 3)  /* Bit 3: IO port D clock enable */
#define RCC_IOPENR_IOPEEN           (1 << 4)  /* Bit 4: IO port E clock enable */
                                              /* Bits 5-6: Reserved */
#define RCC_IOPENR_IOPHEN           (1 << 7)  /* Bit 5: IO port H clock enable */

/* AHB Peripheral Clock enable register */

#define RCC_AHBENR_DMA1EN           (1 << 0)  /* Bit 0: DMA 1 clock enable */
                                              /* Bits 1-7: Reserved */
#define RCC_AHBENR_MIFEN            (1 << 8)  /* Bit 8: Memory interface clock enable */
                                              /* Bits 9-11: Reserved */
#define RCC_AHBENR_CRCEN            (1 << 12) /* Bit 12: Memory interface clock enable */
                                              /* Bits 13-15: Reserved */
#define RCC_AHBENR_TSCEN            (1 << 12) /* Bit 12: Touch sensing clock enable */
                                              /* Bits 17-19: Reserved */
#define RCC_AHBENR_RNGEN            (1 << 20) /* Bit 20: Random number generator module clock enable */
                                              /* Bits 21-23: Reserved */
#define RCC_AHBENR_AESEN            (1 << 24) /* Bit 24: Crypto module (AES) clock enable */
                                              /* Bits 25-31: Reserved */

/* APB2 Peripheral Clock enable register */

#define RCC_APB2ENR_SYSCFGEN        (1 << 0)  /* Bit 0:  System configuration controller clock enable */
                                              /* Bit 1:  Reserved */
#define RCC_APB2ENR_TIM21EN         (1 << 2)  /* Bit 2:  TIM21 timer clock enable */
                                              /* Bits 3-4: Reserved */
#define RCC_APB2ENR_TIM22EN         (1 << 5)  /* Bit 5:  TIM21 timer clock enable */
                                              /* Bits 6-8: Reserved */
#define RCC_APB2ENR_ADC1EN          (1 << 9)  /* Bit 9:  ADC1 interface clock enable */
                                              /* Bits 10-11: Reserved */
#define RCC_APB2ENR_SPI1EN          (1 << 12) /* Bit 12: SPI 1 clock enable */
                                              /* Bit 13: Reserved */
#define RCC_APB2ENR_USART1EN        (1 << 14) /* Bit 14: USART1 clock enable */
                                              /* Bits 15-21: Reserved */
#define RCC_APB2ENR_DBGEN           (1 << 22) /* Bit 22: DBG clock enable */
                                              /* Bits 23-31: Reserved */

/* APB1 Peripheral Clock enable register */

