apache/nuttx/arch/arm/src/stm32l0/hardware/stm32l0_rcc.h
#define RCC_APB1ENR_TIM2EN            (1 << 0)  /* Bit 0:  Timer 2 clock enable */
#define RCC_APB1ENR_TIM3EN            (1 << 1)  /* Bit 1:  Timer 3 clock enable */
                                                /* Bits 2-3: Reserved */
#define RCC_APB1ENR_TIM6EN            (1 << 4)  /* Bit 4:  Timer 6 clock enable */
#define RCC_APB1ENR_TIM7EN            (1 << 5)  /* Bit 5:  Timer 7 clock enable */
                                                /* Bits 6-8: Reserved */
#define RCC_APB1ENR_LCDEN             (1 << 9)  /* Bit 9:  LCD clock enable */
                                                /* Bit 10: Reserved */
#define RCC_APB1ENR_WWDGEN            (1 << 11) /* Bit 11: Window Watchdog clock enable */
                                                /* Bits 12-13: Reserved */
#define RCC_APB1ENR_SPI2EN            (1 << 14) /* Bit 14: SPI 2 clock enable */
                                                /* Bits 15-16: Reserved */
#define RCC_APB1ENR_USART2EN          (1 << 17) /* Bit 17: USART 2 clock enable */
#define RCC_APB1ENR_USART3EN          (1 << 18) /* Bit 18: USART 3 clock enable */
#define RCC_APB1ENR_USART4EN          (1 << 19) /* Bit 19: USART 4 clock enable */
#define RCC_APB1ENR_USART5EN          (1 << 20) /* Bit 20: USART 5 clock enable */
#define RCC_APB1ENR_I2C1EN            (1 << 21) /* Bit 21: I2C 1 clock enable */
#define RCC_APB1ENR_I2C2EN            (1 << 22) /* Bit 22: I2C 2 clock enable */
#define RCC_APB1ENR_USBEN             (1 << 23) /* Bit 23: USB clock enable */
                                                /* Bits 24-26: Reserved */
#define RCC_APB1ENR_CRSEN             (1 << 27) /* Bit 27: Clock recovery system clock enable */
#define RCC_APB1ENR_PWREN             (1 << 28) /* Bit 28: Power interface clock enable */
#define RCC_APB1ENR_DAC1EN            (1 << 29) /* Bit 29: DAC 1 interface clock enable */
#define RCC_APB1ENR_I2C3EN            (1 << 30) /* Bit 30: I2C3 clock enable */
#define RCC_APB1ENR_LPTIM1EN          (1 << 31) /* Bit 31: Low-power timer clock enable */

/* GPIO clock enable in Sleep mode register */

#define RCC_IOPSMENR_IOPASMEN          (1 << 0)  /* Bit 0: IO port A clock enable during Sleep mode */
#define RCC_IOPSMENR_IOPBSMEN          (1 << 1)  /* Bit 1: IO port B clock enable during Sleep mode */
#define RCC_IOPSMENR_IOPCSMEN          (1 << 2)  /* Bit 2: IO port C clock enable during Sleep mode */
#define RCC_IOPSMENR_IOPDSMEN          (1 << 3)  /* Bit 3: IO port D clock enable during Sleep mode */
#define RCC_IOPSMENR_IOPESMEN          (1 << 4)  /* Bit 4: IO port E clock enable during Sleep mode */
                                                 /* Bits 5-6: Reserved */
#define RCC_IOPSMENR_IOPHSMEN          (1 << 7)  /* Bit 7: IO port H clock enable during Sleep mode */

/* AHB peripheral clock enable in Sleep mode register */

#define RCC_AHBSMENR_DMA1SMEN           (1 << 0)  /* Bit 0: DMA 1 clock enable in Sleep mode */
                                                  /* Bits 1-7: Reserved */
#define RCC_AHBSMENR_MIFSMEN            (1 << 8)  /* Bit 8: Memory interface clock enable in Sleep mode */
                                                  /* Bits 9-11: Reserved */
#define RCC_AHBSMENR_CRCSMEN            (1 << 12) /* Bit 12: Memory interface clock enable in Sleep mode */
                                                  /* Bits 13-15: Reserved */
#define RCC_AHBSMENR_TSCSMEN            (1 << 12) /* Bit 12: Touch sensing clock enable in Sleep mode */
                                                  /* Bits 17-19: Reserved */
#define RCC_AHBSMENR_RNGSMEN            (1 << 20) /* Bit 20: Random number generator module clock enable in Sleep mode */
                                                  /* Bits 21-23: Reserved */
#define RCC_AHBSMENR_AESSMEN            (1 << 24) /* Bit 24: Crypto module (AES) clock enable in Sleep mode */
                                                  /* Bits 25-31: Reserved */

/* APB2 peripheral clock enable in Sleep mode register */

#define RCC_APB2SMENR_SYSCFGSMEN        (1 << 0)  /* Bit 0:  System configuration controller clock enable in Sleep mode */
                                                  /* Bit 1:  Reserved */
#define RCC_APB2SMENR_TIM21SMEN         (1 << 2)  /* Bit 2:  TIM21 timer clock enable in Sleep mode */
                                                  /* Bits 3-4: Reserved */
#define RCC_APB2SMENR_TIM22SMEN         (1 << 5)  /* Bit 5:  TIM21 timer clock enable in Sleep mode */
                                                  /* Bits 6-8: Reserved */
#define RCC_APB2SMENR_ADC1SMEN          (1 << 9)  /* Bit 9:  ADC1 interface clock enable in Sleep mode */
                                                  /* Bits 10-11: Reserved */
#define RCC_APB2SMENR_SPI1SMEN          (1 << 12) /* Bit 12: SPI 1 clock enable in Sleep mode */
                                                  /* Bit 13: Reserved */
#define RCC_APB2SMENR_USART1SMEN        (1 << 14) /* Bit 14: USART1 clock enable in Sleep mode */
                                                  /* Bits 15-21: Reserved */
#define RCC_APB2SMENR_DBGSMEN           (1 << 22) /* Bit 22: DBG clock enable in Sleep mode */
                                                  /* Bits 23-31: Reserved */

/* APB1 peripheral clock enable in Sleep mode register */

#define RCC_APB1SMENR_TIM2SMEN          (1 << 0)  /* Bit 0:  Timer 2 clock enable in Sleep mode */
#define RCC_APB1SMENR_TIM3SMEN          (1 << 1)  /* Bit 1:  Timer 3 clock enable in Sleep mode */
                                                  /* Bits 2-3: Reserved */
#define RCC_APB1SMENR_TIM6SMEN          (1 << 4)  /* Bit 4:  Timer 6 clock enable in Sleep mode */
#define RCC_APB1SMENR_TIM7SMEN          (1 << 5)  /* Bit 5:  Timer 7 clock enable in Sleep mode */
                                                  /* Bits 6-8: Reserved */
#define RCC_APB1SMENR_LCDSMEN           (1 << 9)  /* Bit 9: LCD clock enable in Sleep mode */
                                                  /* Bits 10: Reserved */
#define RCC_APB1SMENR_WWDGSMEN          (1 << 11) /* Bit 11: Window Watchdog clock enable in Sleep mode */
                                                  /* Bits 12-13: Reserved */
#define RCC_APB1SMENR_SPI2SMEN          (1 << 14) /* Bit 14: SPI 2 clock enable in Sleep mode */
                                                  /* Bits 15-16: Reserved */
#define RCC_APB1SMENR_USART2SMEN        (1 << 17) /* Bit 17: USART 2 clock enable in Sleep mode */
#define RCC_APB1SMENR_USART3SMEN        (1 << 18) /* Bit 18: USART 3 clock enable in Sleep mode */
#define RCC_APB1SMENR_USART4SMEN        (1 << 19) /* Bit 19: USART 4 clock enable in Sleep mode */
#define RCC_APB1SMENR_USART5SMEN        (1 << 20) /* Bit 20: USART 5 clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C1SMEN          (1 << 21) /* Bit 21: I2C 1 clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C2SMEN          (1 << 22) /* Bit 22: I2C 2 clock enable in Sleep mode */
#define RCC_APB1SMENR_USBSMEN           (1 << 23) /* Bit 23: USB clock enable in Sleep mode */
                                                  /* Bits 24-26: Reserved */
#define RCC_APB1SMENR_CRSSMEN           (1 << 27) /* Bit 27: Clock recovery system clock enable in Sleep mode */
#define RCC_APB1SMENR_PWRSMEN           (1 << 28) /* Bit 28: Power interface clock enable in Sleep mode */
#define RCC_APB1SMENR_DAC1SMEN          (1 << 29) /* Bit 29: DAC 1 interface clock enable in Sleep mode */
#define RCC_APB1SMENR_I2C3SMEN          (1 << 30) /* Bit 30: I2C3 clock enable in Sleep mode */
#define RCC_APB1SMENR_LPTIM1SMEN        (1 << 31) /* Bit 31: Low-power timer clock enable in Sleep mode */

/* Clock configuration register */

#define RCC_CCIPR_USART1SEL_SHIFT       (0)  /* Bits 0-1: USART1 clock source selection */
#define RCC_CCIPR_USART1SEL_MASK        (3 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_APB       (0 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_SYSCLK    (1 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_HSI16     (2 << RCC_CCIPR_USART1SEL_SHIFT)
#  define RCC_CCIPR_USART1SEL_LSE       (3 << RCC_CCIPR_USART1SEL_SHIFT)
#define RCC_CCIPR_USART2SEL_SHIFT       (2)  /* Bits 2-3: USART2 clock source selection */
#define RCC_CCIPR_USART2SEL_MASK        (3 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_APB       (0 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_SYSCLK    (1 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_HSI16     (2 << RCC_CCIPR_USART2SEL_SHIFT)
#  define RCC_CCIPR_USART2SEL_LSE       (3 << RCC_CCIPR_USART2SEL_SHIFT)
                                              /* Bits 4-9: Reserved */
#define RCC_CCIPR_LPUART1SEL_SHIFT      (10)  /* Bits 10-11: LPUART1 clock source selection */
#define RCC_CCIPR_LPUART1SEL_MASK       (3 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_APB      (0 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_SYSCLK   (1 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_HSI16    (2 << RCC_CCIPR_LPUART1SEL_SHIFT)
#  define RCC_CCIPR_LPUART1SEL_LSE      (3 << RCC_CCIPR_LPUART1SEL_SHIFT)
#define RCC_CCIPR_I2C1SEL_SHIFT         (12)  /* Bits 12-13: I2C1 clock source selection */
#define RCC_CCIPR_I2C1SEL_MASK          (3 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_APB         (0 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_SYSCLK      (1 << RCC_CCIPR_I2C1SEL_SHIFT)
#  define RCC_CCIPR_I2C1SEL_HSI16       (2 << RCC_CCIPR_I2C1SEL_SHIFT)
                                              /* Bits 14-15: Reserved */
#define RCC_CCIPR_I2C3SEL_SHIFT         (16)  /* Bits 16-17: I2C3 clock source selection */
#define RCC_CCIPR_I2C3SEL_MASK          (3 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_APB         (0 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_SYSCLK      (1 << RCC_CCIPR_I2C3SEL_SHIFT)
#  define RCC_CCIPR_I2C3SEL_HSI16       (2 << RCC_CCIPR_I2C3SEL_SHIFT)
#define RCC_CCIPR_LPTIM1SEL_SHIFT       (18)  /* Bits 18-19: LPTIM1 clock source selection */
#define RCC_CCIPR_LPTIM1SEL_MASK        (3 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_APB       (0 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_SYSCLK    (1 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_HSI16     (2 << RCC_CCIPR_LPTIM1SEL_SHIFT)
#  define RCC_CCIPR_LPTIM1SEL_LSE       (3 << RCC_CCIPR_LPTIM1SEL_SHIFT)
                                              /* Bits 20-25: Reserved */
#define RCC_CCIPR_CLK48SEL_SHIFT        (26)  /* Bit 26: HSI48 clock source selection */
#define RCC_CCIPR_CLK48SEL_MASK         (1 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_PLL        (0 << RCC_CCIPR_CLK48SEL_SHIFT)
#  define RCC_CCIPR_CLK48SEL_HSI48      (1 << RCC_CCIPR_CLK48SEL_SHIFT)
                                              /* Bits 27-31: Reserved */

/* Control/status register */

#define RCC_CSR_LSION                   (1 << 0)  /* Bit 0: LSI enable */
#define RCC_CSR_LSIRDY                  (1 << 1)  /* Bit 1: ready */
                                                  /* Bits 2-7: Reserved */
#define RCC_CSR_LSEON                   (1 << 8)  /* Bit 8: LSE enable */
#define RCC_CSR_LSERDY                  (1 << 9)  /* Bit 9: LSE ready */
#define RCC_CSR_LSEBPY                  (1 << 10) /* Bit 10: LSE bypass */
#define RCC_CSR_LSEDRV_SHIFT            (11)      /* Bits 11-12: LSE driving capability */
#define RCC_CSR_LSEDRV_MASK             (3 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_LOW            (0 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_MEDLOW         (1 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_MEDHGIH        (2 << RCC_CSR_LSEDRV_SHIFT)
#  define RCC_CSR_LSEDRV_HIGH           (3 << RCC_CSR_LSEDRV_SHIFT)
#define RCC_CSR_CSSLSEON                (1 << 13) /* Bit 13: CSS on LSE enable */
#define RCC_CSR_CSSLSED                 (1 << 14) /* Bit 14: CSS on LSE failure detection flag */
                                                  /* Bit 15: Reserved */
#define RCC_CSR_RTCSEL_SHIFT            (16)      /* Bits 16-17: RTC clock source selection */
#define RCC_CSR_RTCSEL_MASK             (3 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_NOCLK          (0 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_LSE            (1 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_LSI            (2 << RCC_CSR_RTCSEL_SHIFT)
#  define RCC_CSR_RTCSEL_HSE            (3 << RCC_CSR_RTCSEL_SHIFT)
#define RCC_CSR_RTCEN                   (1 << 18) /* Bit 18: RTC clock enable */
#define RCC_CSR_RTCRST                  (1 << 19) /* Bit 19: RTC software reset */
                                                  /* Bits 20-22: Reserved */
#define RCC_CSR_RMVF                    (1 << 23) /* Bit 23: Remove reset flag */
#define RCC_CSR_FWRSTF                  (1 << 24) /* Bit 24: Firewall reset flag */
#define RCC_CSR_OBLRSTF                 (1 << 25) /* Bit 25: Options bytes loading reset flag */
#define RCC_CSR_PINRSTF                 (1 << 26) /* Bit 26: PIN reset flag */
#define RCC_CSR_PORRSTF                 (1 << 27) /* Bit 27: POR/PDR reset flag */
#define RCC_CSR_SFTRSTF                 (1 << 28) /* Bit 28: software reset flag */
#define RCC_CSR_IWDGRSTF                (1 << 29) /* Bit 29: IWDG reset flag */
#define RCC_CSR_WWDGRSTF                (1 << 30) /* Bit 30: WWDG reset flag */
#define RCC_CSR_LPWRRSTF                (1 << 31) /* Bit 31: Low-power reset flag */

#endif /* __ARCH_ARM_SRC_STM32L0_HARDWARE_STM32L0_RCC_H */
